# System
brew "libomp"
cask "aldente"

# Internet
cask "google-chrome"
brew "yt-dlp"
brew "wget"

# Shell Tools
brew "fish"
brew "btop"
brew "htop"
brew "bottom"
brew "bandwhich"
brew "zoxide"
brew "direnv"
brew "starship"
brew "onefetch"
brew "fastfetch"
brew "hyperfine"
cask "ghostty"

# FS Tools
brew "jq"
brew "yq"
brew "fd"
brew "bat"
brew "lsd"
brew "fzf"
brew "zip"
brew "unzip"
brew "p7zip"
brew "7-zip"
brew "dust"
brew "yazi"
brew "ripgrep"

# Media Tools
brew "ffmpeg"
cask "obs"
brew "imagemagick"

# Productivity
cask "raycast"
cask "karabiner-elements"

# Cloud
brew "gh"
brew "glab"
brew "awscli"
brew "cloudflared"

# Development Tools
cask "visual-studio-code"
brew "wakatime-cli"
cask "postman"
brew "gofumpt"
brew "lazygit"
brew "sqlite"
brew "shfmt"
brew "gnupg"
brew "mise"
brew "fvm"
brew "scc"

# AI Coding
tap "anomalyco/tap"
brew "anomalyco/tap/opencode"
cask "claude-code@latest"
cask "codex"

# Docker
brew "colima"
brew "docker"
brew "lazydocker"
brew "docker-buildx"
brew "docker-compose"

# Fonts
cask "font-fira-code-nerd-font"
cask "font-ibm-plex-sans"
