brew "fish"
brew "gh"
brew "mise"
brew "opencode"
brew "starship"
brew "direnv"
brew "zoxide"
cask "font-fira-code-nerd-font"
cask "ghostty"
cask "visual-studio-code"
vscode "anthropic.claude-code"
vscode "bmalehorn.vscode-fish"
vscode "bradlc.vscode-tailwindcss"
vscode "christian-kohler.npm-intellisense"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "golang.go"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "mkhl.shfmt"
vscode "ms-python.autopep8"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "naumovs.color-highlight"
vscode "nazmussayad.editor-context"
vscode "nazmussayad.one-eye-care"
vscode "nazmussayad.rm-comments"
vscode "openai.chatgpt"
vscode "oxc.oxc-vscode"
vscode "pkief.material-icon-theme"
vscode "pomdtr.excalidraw-editor"
vscode "prisma.prisma"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "streetsidesoftware.code-spell-checker"
vscode "tamasfe.even-better-toml"
vscode "tobermory.es6-string-html"
vscode "usernamehw.errorlens"
vscode "vincaslt.highlight-matching-tag"
vscode "wakatime.vscode-wakatime"
