
brew "btop"
brew "cloudflared"
brew "direnv"
brew "fastfetch"
brew "fish"
brew "fvm"
brew "gh"
brew "htop"
brew "hyperfine"
brew "libomp"
brew "mise"
brew "opencode"
brew "starship"
brew "wakatime-cli"
brew "zoxide"
cask "font-fira-code-nerd-font"
cask "font-ibm-plex-sans"
cask "ghostty"
cask "codex"
cask "codexbar"
cask "slack"
cask "visual-studio-code"
