# Basic Apps
MSYS2.MSYS2
ShareX.ShareX
RARLab.WinRAR
Daum.PotPlayer
9MSMLRH6LZF3 # Windows Notepad
9NBLGGH68TW4 # Pictureflect Photo Viewer
Piriform.CCleaner
ThioJoe.SvgThumbnailExtension

# Productivity
Notion.Notion
OBSProject.OBSStudio
PowerSoftware.AnyBurn
UnifiedIntents.UnifiedRemote

# Browsers
Google.Chrome
Mozilla.Firefox.DeveloperEdition

# Code Editors
Microsoft.VisualStudioCode
Anysphere.Cursor

# Programming Languages
CoreyButler.NVMforWindows
Python.PythonInstallManager

# Programming Tools
Git.Git
GitHub.cli
GoLang.Go
Postman.Postman
ApacheFriends.Xampp.8.2
PostgreSQL.PostgreSQL.17

# Communication
SlackTechnologies.Slack